// 1.4
// 자바스크립트는 1995년 12월에 개발되었다. (10일만에 만들었음)
// 자바스크립트를 만든이유는 넷스케이프 때문이다. 넷스케이프는 웹사이트를 좀더 활용적이게 만들고자 자바스크립트를 만들게 된 것이다. (하지만 자바스크립트는 이미 존재했다.)
// 이미 존재했던 자바스크립트를 쓰자라고 결정했다.
// 자바스크립트가 프론트엔드로 쓸 수 있는 유일한 언어이다. 가장 중요한 포인트가 된다.
// 자바스크립트는 웹 전체를 이루는 언어이다.
// 모든 브라우저들은 딱 세가지의 언어를 이해한다 HTML, CSS, 자바스크립트
// 스마트폰에도 브라우저가 있으면 자바스크립트를 실행할 수 있다.
// 백엔드의 경우에는 파이썬, 자바, 등등을 활용해도 된다. 하지만 프론트엔드의 경우에는 자바스크립트 하나뿐이다. (대체불가 언어)

// 1.5
// Three.js는 자바스크립트를 3D로 구현하게 해주는 도구다 (데이터 시각화, 비디오 게임)
// 프레임워크는 내가 하려는 일을 도와주는 도구다.
// 리액트 네이티브는 자바스크립트만으로 안드로이드랑 ios앱을 만들수 있게 해준다.
// 일렉트론은 데스크탑 앱을 만들수 있게 해준다.
// 이제는 자바스크립트로도 백엔드를 구현할 수 있다.
// 실시간 채팅기능도 자바스크립트를 활용한 예시이다. 머신러닝도 가능
